app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2009-09-09 21:17:26', '80bdd65b195ac1323db9cbfde479591b19808df5c85a7fe02e70c3cb46012856ca24007d2a93ef8f0a334d743a479815f7136e012b26477d648e67a19f9fb42d', '2009-09-09 21:17:26', 'lucascaton', 'BSAxoQqmwC1wOviqqzd0', '5b89052b250c597f3103ee92def7e99d6741990131816d1f61942a39e2e62cdb3a71091284ad5d509e8a377c37056a512106bf6c5b374eba0afdfa7e487976ab', 'lucascaton@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save